In [42]:
import numpy as np
import pandas as pd

In [43]:
df_emp = pd.read_excel('employees.xls')

In [44]:
df_dep = pd.read_excel('departments.xls')

WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero

In [45]:
df_emp.shape

(107, 11)

In [46]:
df_emp.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,2003-06-17 00:00:00,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21 00:00:00,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13 00:00:00,AD_VP,17000,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03 00:00:00,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21 00:00:00,IT_PROG,6000,NaN,103.0,60.0

In [47]:
df_emp.groupby('DEPARTMENT_ID')['SALARY'].mean()

DEPARTMENT_ID
10.0      4400.000000
20.0      9500.000000
30.0      4150.000000
40.0      6500.000000
50.0      3475.555556
60.0      5760.000000
70.0     10000.000000
80.0      8955.882353
90.0     19333.333333
100.0     8601.333333
110.0    10154.000000
Name: SALARY, dtype: float64

In [48]:
df_emp.groupby('DEPARTMENT_ID')['SALARY'].mean().reset_index()

    DEPARTMENT_ID        SALARY
0            10.0   4400.000000
1            20.0   9500.000000
2            30.0   4150.000000
3            40.0   6500.000000
4            50.0   3475.555556
5            60.0   5760.000000
6            70.0  10000.000000
7            80.0   8955.882353
8            90.0  19333.333333
9           100.0   8601.333333
10          110.0  10154.000000

In [49]:
df_emp.groupby('DEPARTMENT_ID')['SALARY'].agg(['count','sum','mean','min','max'])

               count     sum          mean    min    max
DEPARTMENT_ID
10.0               1    4400   4400.000000   4400   4400
20.0               2   19000   9500.000000   6000  13000
30.0               6   24900   4150.000000   2500  11000
40.0               1    6500   6500.000000   6500   6500
50.0              45  156400   3475.555556   2100   8200
60.0               5   28800   5760.000000   4200   9000
70.0               1   10000  10000.000000  10000  10000
80.0              34  304500   8955.882353   6100  14000
90.0               3   58000  19333.333333  17000  24000
100.0              6   51608   8601.333333   6900  12008
110.0              2   20308  10154.000000   8300  12008

In [50]:
df_emp.groupby('DEPARTMENT_ID')['SALARY'].agg(['count','sum','mean','min','max']).reset_index()

    DEPARTMENT_ID  count     sum          mean    min    max
0            10.0      1    4400   4400.000000   4400   4400
1            20.0      2   19000   9500.000000   6000  13000
2            30.0      6   24900   4150.000000   2500  11000
3            40.0      1    6500   6500.000000   6500   6500
4            50.0     45  156400   3475.555556   2100   8200
5            60.0      5   28800   5760.000000   4200   9000
6            70.0      1   10000  10000.000000  10000  10000
7            80.0     34  304500   8955.882353   6100  14000
8            90.0      3   58000  19333.333333  17000  24000
9           100.0      6   51608   8601.333333   6900  12008
10          110.0      2   20308  10154.000000   8300  12008

In [51]:
emp = df_emp[['EMPLOYEE_ID', 'FIRST_NAME', 'SALARY', 'JOB_ID', 'DEPARTMENT_ID']]

In [52]:
emp = pd.merge(emp, df_dep[['DEPARTMENT_ID','DEPARTMENT_NAME']])

In [53]:
emp.head()

   EMPLOYEE_ID FIRST_NAME  SALARY   JOB_ID  DEPARTMENT_ID DEPARTMENT_NAME
0          100     Steven   24000  AD_PRES           90.0       Executive
1          101      Neena   17000    AD_VP           90.0       Executive
2          102        Lex   17000    AD_VP           90.0       Executive
3          103  Alexander    9000  IT_PROG           60.0              IT
4          104      Bruce    6000  IT_PROG           60.0              IT

In [54]:
emp_ = emp.groupby(['DEPARTMENT_ID','DEPARTMENT_NAME'])['SALARY'].mean()
emp_

DEPARTMENT_ID  DEPARTMENT_NAME
10.0           Administration       4400.000000
20.0           Marketing            9500.000000
30.0           Purchasing           4150.000000
40.0           Human Resources      6500.000000
50.0           Shipping             3475.555556
60.0           IT                   5760.000000
70.0           Public Relations    10000.000000
80.0           Sales                8955.882353
90.0           Executive           19333.333333
100.0          Finance              8601.333333
110.0          Accounting          10154.000000
Name: SALARY, dtype: float64

In [55]:
emp_.loc[(80,)]

DEPARTMENT_NAME
Sales    8955.882353
Name: SALARY, dtype: float64

In [56]:
emp_.loc[(30,'Purchasing')]

4150.0

In [57]:
emp_.iloc[2]

4150.0

In [58]:
emp_ = emp.groupby(['DEPARTMENT_ID','JOB_ID'])['SALARY'].mean()
emp_

DEPARTMENT_ID  JOB_ID
10.0           AD_ASST        4400.000000
20.0           MK_MAN        13000.000000
               MK_REP         6000.000000
30.0           PU_CLERK       2780.000000
               PU_MAN        11000.000000
40.0           HR_REP         6500.000000
50.0           SH_CLERK       3215.000000
               ST_CLERK       2785.000000
               ST_MAN         7280.000000
60.0           IT_PROG        5760.000000
70.0           PR_REP        10000.000000
80.0           SA_MAN        12200.000000
               SA_REP         8396.551724
90.0           AD_PRES       24000.000000
               AD_VP         17000.000000
100.0          FI_ACCOUNT     7920.000000
               FI_MGR        12008.000000
110.0          AC_ACCOUNT     8300.000000
               AC_MGR        12008.000000
Name: SALARY, dtype: float64

In [59]:
emp_.iloc[2]

6000.0

In [60]:
emp_.loc[(30,'PU_MAN')]

11000.0